# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

#这个文件是 YOLOv8 模型的结构配置文件（YAML 格式），用于定义神经网络的各个层级、参数和结构，
#包括主干网络（backbone）和检测头（head）。训练或推理时，框架会读取该文件来构建对应的模型结构。


# 参数
nc: 80 # 类别数量
scales: # 模型复合缩放常量，例如 'model=yolov8n.yaml' 会调用 yolov8.yaml 并使用缩放 'n'
  # [深度, 宽度, 最大通道数]
  n: [0.33, 0.25, 1024] # YOLOv8n-worldv2 概要: 148 层, 3695183 参数, 3695167 梯度, 19.5 GFLOPS
  s: [0.33, 0.50, 1024] # YOLOv8s-worldv2 概要: 148 层, 12759880 参数, 12759864 梯度, 51.0 GFLOPS
  m: [0.67, 0.75, 768] # YOLOv8m-worldv2 概要: 188 层, 28376158 参数, 28376142 梯度, 110.5 GFLOPS
  l: [1.00, 1.00, 512] # YOLOv8l-worldv2 概要: 228 层, 46832050 参数, 46832034 梯度, 204.5 GFLOPS
  x: [1.00, 1.25, 512] # YOLOv8x-worldv2 概要: 228 层, 72886377 参数, 72886361 梯度, 309.3 GFLOPS

# YOLOv8.0n 主干网络
backbone:
  # [来源, 重复次数, 模块, 参数]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8.0n 检测头
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # 拼接主干网络 P4
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # 拼接主干网络 P3
  - [-1, 3, C2f, [256]] # 15 (P3/8-小)

  - [15, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # 拼接检测头 P4
  - [-1, 3, C2f, [512]] # 18 (P4/16-中)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # 拼接检测头 P5
  - [-1, 3, C2f, [1024]] # 21 (P5/32-大)

  - [[15, 18, 21], 1, YOLOEDetect, [nc, 512, True]] # 检测(P3, P4, P5)
